railsApi/app/controllers/api/boxes_controller.rb

    def index
        render :json => Box.all
---
SELECT "boxes".* FROM "boxes"

    def create
        box = Box.new(box_params)
        if box.save
---
INSERT INTO "boxes" ("name", "description", "year", "imgUrl", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "test"], ["description", "test"], ["year", "test"], ["imgUrl", "test"], ["created_at", "2019-06-20 22:41:45.322322"], ["updated_at", "2019-06-20 22:41:45.322322"]]

    def destroy
        if box.destroy
---
DELETE FROM "boxes" WHERE "boxes"."id" = ?  [["id", 1]]

    def set_box
        box = Box.find_by(id: params[:id])
---
SELECT  "boxes".* FROM "boxes" WHERE "boxes"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]