railsApi/app/controllers/api/notes_controller.rb

    def index
        render :json => Note.all
---
SELECT "notes".* FROM "notes"

    def create
        note = Note.new(note_params)
        if note.save
---
INSERT INTO "notes" ("subject", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["subject", "test"], ["content", "This is a test of the National Broadcast System."], ["created_at", "2019-06-26 20:24:34.110355"], ["updated_at", "2019-06-26 20:24:34.110355"]]

    def destroy
        @note = Note.find_by(id: params[:id])
        if @note.delete
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]